Repository: michaelmcandrew/wcn
Catalog: modules/relatedcontent/po/*.po
Languages: fr

source: Title
fr: Titre

source: Author
fr: Auteur

source: Created
fr: Créé

source: No nodes selected.
fr: Aucun noeud sélectionné.

source: View
fr: Voir

source: Display name (optional)
fr: Nom à afficher (optionnel)

source: Weight
fr: Poids

source: No views available.
fr: Aucune vue disponible.

source: RelatedContent
fr: RelatedContent (Contenu Lié)

source: Overview
fr: Aperçu

source: RelatedContent configuration
fr: Configuration de RelatedContent (Contenu Lié)

source: Configure how RelatedContent should work on nodes of the type %type. For more information, see the !help.
fr: Configurer la manière dont doit fonctionner RelatedContent (Contenu Lié) pour les noeuds de type %type. Pour plus d'informations, consulter l'!help

source: help page
fr: page d'aide

source: Enable
fr: Activé

source: Check to enable RelatedContent for nodes of this content type.
fr: Cocher pour activer RelatedContent (Contenu Lié) pour les noeuds de ce type de contenu.

source: Settings
fr: Paramètres

source: Length of node table
fr: Longueur de la table des noeuds

source: The number of nodes to be displayed on each page of the table with nodes to select from.
fr: Le nombre de noeuds à afficher sur chaque page de la table des noeuds parmi lesquels sélectionner.

source: All nodes
fr: Tous les noeuds

source: Related content in teasers
fr: Contenu lié dans les résumés

source: Choose whether the related content of a node should be included or excluded in the teaser of that node.
fr: Sélectionnez si le contenu lié doit être inclus ou exclus des résumés de ce noeud.

source: Include
fr: Inclure

source: Exclude
fr: Exclure

source: Where to display
fr: Où l'afficher

source: Choose if the where the related content should be outputted.
fr: Sélectionnez où le contenu lié doit être affiché.

source: Beginning
fr: Au début

source: End
fr: Fin

source: What to display
fr: Qu'afficher

source: Choose whether the related content should be displayed as teasers or bodies of the selected nodes.
fr: Sélectionnez si le contenu lié doit être affiché en tant que résumé ou corps des noeuds sélectionnés.

source: Teasers
fr: Résumés

source: Bodies
fr: Corps

source: How to display
fr: Comment l'afficher

source: Choose how the related content should be grouped.
fr: Sélectionner la manière dont le contenu lié doit être regroupé.

source: Grouped by content type
fr: Regroupé par type de contenu

source: Grouped by author
fr: Regroupé par auteur

source: Grouped by view
fr: Regroupé par vue

source: Without grouping
fr: Sans regroupement

source: Views
fr: Vues

source: The table below lists all available views from which related content can be selected, as well as any deleted view for which nodes has been selected. The <em>View</em> and <em>Description</em> columns contains the names and descriptions, respectively, of the views, as seen in the !views page. When the related content is displayed grouped by view, the values of the <em>Display name</em> column is used as headings of the groups, or, if left blank, the views' names. The related content is displayed view by view. The order of the views is determined from their values in the <em>Weight</em> column. Tick the views to be used by nodes of this content type.
fr: Le tableau ci-dessous liste l'ensemble des vues disponibles pour la sélection des contenus liés, ainsi que toutes les vues supprimées pour lesquelles des noeuds ont été sélectionnés. Les colonnes <em>Vue</em> et <em>Description </em> contiennent respectivement les noms et descriptions des vues, comme vu sur la page !views. Lorsque le contenu lié est affiché regroupé par vue, les valeurs de la colonne <em>Nom à afficher</em> sont utilisées comme titres des groupes, ou bien, si laissées vides, le noms des vues. Le contenu lié est affiché vue par vue. L'ordre des vues est déterminé d'après les valeurs de la colonne <em>Poids</em>. Cochez les vues à utiliser pour les noeuds ce ce type de contenu.

source: Administer views
fr: Administrer les vues

source: The table below lists nodes that have content related to this node. The nodes are grouped by the Views from which they once were selected. To remove nodes from the table, untick their checkboxes and press the <em>Update</em> button. For more information, see the !help.
fr: Le tableau ci-desous liste les noeuds qui possédent du contenu lié à ce noeud. Les noeuds sont regroupés selon les vues pour lesquelles ils ont été sélectionnés une fois. Pour supprimer des noeuds du tableau, décochez leurs cases et cliquez sur le bouton <em>Mettre à jour</em>. Pour plus d'informations, voir l'!help.

source: Update
fr: Mise à Jour

source: RelatedContent uses <a href="!views-url">views</a> as its source of nodes. The specified view %view-name doesn't exist any more. Please, go to the <a href="!settings-url">settings of the content type "@content-type"</a> and select another view.
fr: RelatedContent (Contenu Lié) utilise les <a href="!views-url">vues</a> en tant que source de noeuds. La vue spécifiée %view-name n'existe plus. Veuillez vous rendre à la page de <a href="!settings-url">paramètres du type de contenu "@content-type"</a> et sélectionner une autre vue.

source: Next
fr: Suivant

source: Previous
fr: Précédent

source: Select nodes to be added to this %type. For more information, see the !help.
fr: Sélectionnez les noeuds à ajouter à ce(tte) %type. Pour plus d'informations, voir l'!help.

source: RelatedContent doesn't support !db_type.
fr: RelatedContent (Contenu Lié) ne supporte pas !db_type.

source: RelatedContent can't find the !query_name query for !db_type.
fr: RelatedContent (Contenu Lié) ne peut pas trouvé la requête !query_name pour !db_type.

source: relatedcontent
fr: relatedcontent (contenu lié)

source: !hook() doesn't support !db
fr: !hook() ne supporte pas !db

source: Allows privileged users to associate a node with related nodes that can be displayed along with the node.
fr: Permet aux utilisateurs autorisés d'associer des noeuds liés pouvant être affichés avec un noeud.
